# Operations

Some other methods associated with DataFrames.

In [20]:
import pandas as pd

In [21]:
df = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 444],
    'col3': 'abc def ghi xyz'.split()})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Explore unique values.

In [22]:
# Show each unique value.
df['col2'].unique()

array([444, 555, 666])

In [23]:
# Count the number of unique values, n.
df['col2'].nunique()

3

### Select from multiple columns with multiple criteria.

In [24]:
             # Criterion 1    # Criterion 2
new_df = df[ (df['col1']>2) & (df['col2']==444) ]
new_df

   col1  col2 col3
3     4   444  xyz

### Apply functions

Let's λ get λ functional.

In [25]:
# Define a function and apply it to all elements.

def double(x):
    return x * 2

df['col1'].apply(double)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [26]:
# Apply built-in functions.
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [27]:
df.sum()

col1              10
col2            2109
col3    abcdefghixyz
dtype: object

In [28]:
# Pass a cool anonymous function.
df['col2'].apply(lambda x: x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

### Permanently remove a column.

In [30]:
del df['col1']
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

### Get column and index names.

In [31]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [32]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sort and order.

In [33]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [34]:
# Return a new, sorted DataFrame.
# inplace=False by default.
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

### Find null values.

In [35]:
# There are no null values in this DataFrame.
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

### Make a pivot table.

In [37]:
data = {
    'A': 'foo foo foo bar bar bar'.split(),
    'B': 'one one two two one one'.split(),
    'C': 'x   y   x   y   x   y'.split(),
    'D': [1, 3, 2, 5, 4, 1]
}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [38]:
df.pivot_table(
    values='D',
    index=['A', 'B'],
    columns='C'
)

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN